ChibiOS/ChibiOS/os/hal/ports/STM32/STM32WLxx/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006..2018 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32WLxx/hal_lld.h
 * @brief   STM32WLxx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32WLE5Cx, STM32WLE5Jx, STM32WLE5Ux.
 *          - STM32WLE4Cx, STM32WLE4Jx, STM32WLE4Ux.
 *          - STM32WL5Cx, STM32WL5Jx, STM32WL5Ux.
 *          - STM32WL4Cx, STM32WL4Jx, STM32WL4Ux.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_H
#define HAL_LLD_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Platform identification
 * @{
 */
#if defined(STM32WLE5xx) || defined(STM32WLE4xx) || \
    defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32WLExx Ultra-low power multi-modulation wireless microcontrollers"
#elif defined(STM32WL55xx) || defined(STM32WL54xx) || \
      defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32WL5xx Ultra-low power multi-modulation wireless microcontrollers, dual core"
#else
#error "STM32WLxx device not specified"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(STM32WLXX) || defined(__DOXYGEN__)
#define STM32WLXX
#endif
/** @} */

/**
 * @name   Clock points names
 * @{
 */
#define CLK_SYSCLK              0U
#define CLK_PLLPCLK             1U
#define CLK_PLLQCLK             2U
#define CLK_PLLRCLK             3U
#define CLK_HCLK                4U
#define CLK_PCLK1               5U
#define CLK_PCLK1TIM            6U
#define CLK_PCLK2               7U
#define CLK_PCLK2TIM            8U
#define CLK_HCLK3               9U
#define CLK_MCO                 10U
#define CLK_ARRAY_SIZE          11U
/** @} */

/**
 * @name    HSE32 clock sources
 * @{
 */
#define STM32_HSE32_XTAL        0           /**< External crystal.          */
#define STM32_HSE32_TCXO        1           /**< TCXO.                      */
#define STM32_HSE32_EXTS        2           /**< External source.           */
/** @} */

/**
 * @name    PWR_CR1 register bits definitions
 * @{
 */
#define STM32_VOS_MASK          (3 << 9)    /**< Core voltage mask.         */
#define STM32_VOS_RANGE1        (1 << 9)    /**< Core voltage 1.2 Volts.    */
#define STM32_VOS_RANGE2        (2 << 9)    /**< Core voltage 1.0 Volts.    */
/** @} */

/* Some ST headers do not have this definition.*/
#if !defined(PWR_CR2_PLS_LVL0)
#define PWR_CR2_PLS_LVL0        (0x0UL << PWR_CR2_PLS_Pos)
#endif

/* Some ST headers do not have this definition.*/
#if !defined(PWR_CR2_PLS_LVL1)
#define PWR_CR2_PLS_LVL1        (0x1UL << PWR_CR2_PLS_Pos)
#endif

/* Some ST headers do not have this definition.*/
#if !defined(PWR_CR2_PLS_LVL2)
#define PWR_CR2_PLS_LVL2        (0x2UL << PWR_CR2_PLS_Pos)
#endif

/* Some ST headers do not have this definition.*/
#if !defined(PWR_CR2_PLS_LVL3)
#define PWR_CR2_PLS_LVL3        (0x3UL << PWR_CR2_PLS_Pos)
#endif

/* Some ST headers do not have this definition.*/
#if !defined(PWR_CR2_PLS_LVL4)
#define PWR_CR2_PLS_LVL4        (0x4UL << PWR_CR2_PLS_Pos)
#endif

/* Some ST headers do not have this definition.*/
#if !defined(PWR_CR2_PLS_LVL5)
#define PWR_CR2_PLS_LVL5        (0x5UL << PWR_CR2_PLS_Pos)
#endif

/* Some ST headers do not have this definition.*/
#if !defined(PWR_CR2_PLS_LVL6)
#define PWR_CR2_PLS_LVL6        (0x6UL << PWR_CR2_PLS_Pos)
#endif

/* Some ST headers do not have this definition.*/
#if !defined(PWR_CR2_PLS_LVL7)
#define PWR_CR2_PLS_LVL7        (0x7UL << PWR_CR2_PLS_Pos)
#endif

/**
 * @name    PWR_CR4 register bits definitions
 * @{
 */
#define STM32_VBRS_MASK         (1 << 9)    /**< VBRS field mask.           */
#define STM32_VBRS_RES_5K       (0 << 9)    /**< VBRS 5k resistor.          */
#define STM32_VBRS_RES_1K5      (1 << 9)    /**< VBRS 1.5k resistor.        */
#define STM32_VBE_MASK          (1 << 8)    /**< VBE field mask.            */
#define STM32_VBE_RESET         (0 << 8)    /**< VBE reset.                 */
#define STM32_VBE_SET           (1 << 8)    /**< VBE set.                   */
/** @} */

/**
 * @name    RCC_CR register bits definitions
 * @{
 */
#define STM32_HSE32PRE_MASK     (1 << 20)   /**< HSEPRE field mask.         */
#define STM32_HSE32PRE_DIV1     (0 << 20)   /**< HSE divided by 1.          */
#define STM32_HSE32PRE_DIV2     (1 << 20)   /**< HSE divided by 2.          */
/** @} */

/**
 * @name    RCC_CFGR register bits definitions
 * @{
 */
#define STM32_SW_MASK           (3 << 0)    /**< SW field mask.             */
#define STM32_SW_MSI            (0 << 0)    /**< SYSCLK source is MSI.      */
#define STM32_SW_HSI16          (1 << 0)    /**< SYSCLK source is HSI.      */
#define STM32_SW_HSE            (2 << 0)    /**< SYSCLK source is HSE.      */
#define STM32_SW_PLL            (3 << 0)    /**< SYSCLK source is PLL.      */

#define STM32_STOPWUCK_MASK     (1 << 15)   /**< STOPWUCK field mask.       */
#define STM32_STOPWUCK_MSI      (0 << 15)   /**< Wakeup clock is MSI.       */
#define STM32_STOPWUCK_HSI16    (1 << 15)   /**< Wakeup clock is HSI16.     */

#define STM32_MCOSEL_MASK       (15 << 24)  /**< MCOSEL field mask.         */
#define STM32_MCOSEL_NOCLOCK    (0 << 24)   /**< No clock on MCO pin.       */
#define STM32_MCOSEL_SYSCLK     (1 << 24)   /**< SYSCLK on MCO pin.         */
#define STM32_MCOSEL_MSI        (2 << 24)   /**< MSI clock on MCO pin.      */
#define STM32_MCOSEL_HSI16      (3 << 24)   /**< HSI16 clock on MCO pin.    */
#define STM32_MCOSEL_HSE32      (4 << 24)   /**< HSE32 clock on MCO pin.      */
#define STM32_MCOSEL_PLL        (5 << 24)   /**< PLL clock on MCO pin.      */
#define STM32_MCOSEL_LSI        (6 << 24)   /**< LSI clock on MCO pin.      */
#define STM32_MCOSEL_LSE        (8 << 24)   /**< LSE clock on MCO pin.      */
#define STM32_MCOSEL_PLLP       (13 << 24)  /**< PLLP clock on MCO pin.     */
#define STM32_MCOSEL_PLLQ       (14 << 24)  /**< PLLQ clock on MCO pin.     */

#define STM32_MCOPRE_MASK       (7 << 28)   /**< MCOPRE field mask.         */
#define STM32_MCOPRE_DIV1       (0 << 28)   /**< MCO divided by 1.          */
#define STM32_MCOPRE_DIV2       (1 << 28)   /**< MCO divided by 2.          */
#define STM32_MCOPRE_DIV4       (2 << 28)   /**< MCO divided by 4.          */
#define STM32_MCOPRE_DIV8       (3 << 28)   /**< MCO divided by 8.          */
#define STM32_MCOPRE_DIV16      (4 << 28)   /**< MCO divided by 16.         */
/** @} */

