ChibiOS/ChibiOS/os/hal/ports/STM32/STM32WLxx/hal_lld.h
/*
 * Configuration-related checks.
 */
#if !defined(STM32WLxx_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32WLxx_MCUCONF not defined"
#endif

/*
 * Board files sanity checks.
 */
#if !defined(STM32_LSECLK)
#error "STM32_LSECLK not defined in board.h"
#endif

#if !defined(STM32_LSEDRV)
#error "STM32_LSEDRV not defined in board.h"
#endif

/* PLL multipliers/dividers limits*/
/**
 * @name    PLL limits
 * @{
 */

/**
 * @brief   Maximum PLLM value.
 */
#define STM32_PLLM_VALUE_MAX        8

/**
 * @brief   Minimum PLLM value.
 */
#define STM32_PLLM_VALUE_MIN        1

/**
 * @brief   Maximum PLLN value.
 */
#define STM32_PLLN_VALUE_MAX        127

/**
 * @brief   Minimum PLLN value.
 */
#define STM32_PLLN_VALUE_MIN        6

/**
 * @brief   Maximum PLLR value.
 */
#define STM32_PLLR_VALUE_MAX        8

/**
 * @brief   Minimum PLLR value.
 */
#define STM32_PLLR_VALUE_MIN        2

/**
 * @brief   Maximum PLLQ value.
 */
#define STM32_PLLQ_VALUE_MAX        8

/**
 * @brief   Minimum PLLQ value.
 */
#define STM32_PLLQ_VALUE_MIN        2

/**
 * @brief   Maximum PLLP value.
 */
#define STM32_PLLP_VALUE_MAX        32

/**
 * @brief   Minimum PLLP value.
 */
#define STM32_PLLP_VALUE_MIN        2

/** @} */

/**
 * @brief   Low Power Run mode sysclk limit.
 */
#define STM32_LPRUN_SYSCLK_MAX      2000000U

/**
 * @brief   Range 1 Voltage related limits.
 * @{
 */
#define STM32_VOS1_SYSCLK_MAX       48000000U
#define STM32_VOS1_LSECLK_MAX       32768U
#define STM32_VOS1_LSECLK_BYP_MAX   1000000U
#define STM32_VOS1_LSECLK_MIN       32768U
#define STM32_VOS1_LSECLK_BYP_MIN   32768U
#define STM32_VOS1_PLLIN_MAX        16000000U
#define STM32_VOS1_PLLIN_MIN        2660000U
#define STM32_VOS1_PLLVCO_MAX       344000000U
#define STM32_VOS1_PLLVCO_MIN       96000000U
#define STM32_VOS1_PLLP_MAX         48000000U
#define STM32_VOS1_PLLP_MIN         3000000U
#define STM32_VOS1_PLLQ_MAX         48000000U
#define STM32_VOS1_PLLQ_MIN         12000000U
#define STM32_VOS1_PLLR_MAX         48000000U
#define STM32_VOS1_PLLR_MIN         12000000U
#define STM32_VOS1_PCLK1_MAX        80000000U
#define STM32_VOS1_PCLK2_MAX        80000000U
#define STM32_VOS1_ADCCLK_MAX       48000000U
#define STM32_VOS1_0WS_THRESHOLD    18000000U
#define STM32_VOS1_1WS_THRESHOLD    36000000U
#define STM32_VOS1_2WS_THRESHOLD    48000000U
/** @} */

/**
 * @brief   Range 2 Voltage related limits.
 * @{
 */
#define STM32_VOS2_SYSCLK_MAX       16000000U
#define STM32_VOS2_LSECLK_MAX       32768U
#define STM32_VOS2_LSECLK_BYP_MAX   1000000U
#define STM32_VOS2_LSECLK_MIN       32768U
#define STM32_VOS2_LSECLK_BYP_MIN   32768U
#define STM32_VOS2_PLLIN_MAX        16000000U
#define STM32_VOS2_PLLIN_MIN        2660000U
#define STM32_VOS2_PLLVCO_MAX       128000000U
#define STM32_VOS2_PLLVCO_MIN       96000000U
#define STM32_VOS2_PLLP_MAX         16000000U
#define STM32_VOS2_PLLP_MIN         3000000U
#define STM32_VOS2_PLLQ_MAX         12000000U
#define STM32_VOS2_PLLQ_MIN         16000000U
#define STM32_VOS2_PLLR_MAX         16000000U
#define STM32_VOS2_PLLR_MIN         12000000U
#define STM32_VOS2_PCLK1_MAX        16000000U
#define STM32_VOS2_PCLK2_MAX        16000000U
#define STM32_VOS2_ADCCLK_MAX       16000000U
#define STM32_VOS2_0WS_THRESHOLD    6000000U
#define STM32_VOS2_1WS_THRESHOLD    12000000U
#define STM32_VOS2_2WS_THRESHOLD    16000000U
/** @} */

/* Voltage related limits.*/
#if (STM32_VOS == STM32_VOS_RANGE1) || defined(__DOXYGEN__)
/**
 * @name    System Limits
 * @{
 */
/**
 * @brief   Maximum SYSCLK clock frequency at current voltage setting.
 */
#define STM32_SYSCLK_MAX            STM32_VOS1_SYSCLK_MAX

/**
 * @brief   Maximum LSE clock frequency.
 */
#define STM32_LSECLK_MAX            STM32_VOS1_LSECLK_MAX

/**
 * @brief   Maximum LSE clock frequency.
 */
#define STM32_LSECLK_BYP_MAX        STM32_VOS1_LSECLK_BYP_MAX

/**
 * @brief   Minimum LSE clock frequency.
 */
#define STM32_LSECLK_MIN            STM32_VOS1_LSECLK_MIN

/**
 * @brief   Minimum LSE clock frequency.
 */
#define STM32_LSECLK_BYP_MIN        STM32_VOS1_LSECLK_BYP_MIN

/**
 * @brief   Maximum PLLs input clock frequency.
 */
#define STM32_PLLIN_MAX             STM32_VOS1_PLLIN_MAX

/**
 * @brief   Minimum PLLs input clock frequency.
 */
#define STM32_PLLIN_MIN             STM32_VOS1_PLLIN_MIN

/**
 * @brief   Maximum VCO clock frequency at current voltage setting.
 */
#define STM32_PLLVCO_MAX            STM32_VOS1_PLLVCO_MAX

/**
 * @brief   Minimum VCO clock frequency at current voltage setting.
 */
#define STM32_PLLVCO_MIN            STM32_VOS1_PLLVCO_MIN

/**
 * @brief   Maximum PLL-P output clock frequency.
 */
#define STM32_PLLP_MAX              STM32_VOS1_PLLP_MAX

/**
 * @brief   Minimum PLL-P output clock frequency.
 */
#define STM32_PLLP_MIN              STM32_VOS1_PLLP_MIN

/**
 * @brief   Maximum PLL-Q output clock frequency.
 */
#define STM32_PLLQ_MAX              STM32_VOS1_PLLQ_MAX

/**
 * @brief   Minimum PLL-Q output clock frequency.
 */
#define STM32_PLLQ_MIN              STM32_VOS1_PLLQ_MIN

/**
 * @brief   Maximum PLL-R output clock frequency.
 */
#define STM32_PLLR_MAX              STM32_VOS1_PLLR_MAX

/**
 * @brief   Minimum PLL-R output clock frequency.
 */
#define STM32_PLLR_MIN              STM32_VOS1_PLLR_MIN

/**
 * @brief   Maximum APB1 clock frequency.
 */
#define STM32_PCLK1_MAX             STM32_VOS1_PCLK1_MAX

/**
 * @brief   Maximum APB2 clock frequency.
 */
#define STM32_PCLK2_MAX             STM32_VOS1_PCLK2_MAX

/**
 * @brief   Maximum ADC clock frequency.
 */
#define STM32_ADCCLK_MAX            STM32_VOS1_ADCCLK_MAX

/**
 * @name    Flash Wait states
 * @{
 */
#define STM32_0WS_THRESHOLD         STM32_VOS1_0WS_THRESHOLD
#define STM32_1WS_THRESHOLD         STM32_VOS1_1WS_THRESHOLD
#define STM32_2WS_THRESHOLD         STM32_VOS1_2WS_THRESHOLD
/** @} */

