ChibiOS/ChibiOS/os/hal/ports/STM32/STM32WLxx/hal_lld.h
#elif STM32_VOS == STM32_VOS_RANGE2
#define STM32_SYSCLK_MAX            STM32_VOS2_SYSCLK_MAX
#define STM32_LSECLK_MAX            STM32_VOS2_LSECLK_MAX
#define STM32_LSECLK_BYP_MAX        STM32_VOS2_LSECLK_BYP_MAX
#define STM32_LSECLK_MIN            STM32_VOS2_LSECLK_MIN
#define STM32_LSECLK_BYP_MIN        STM32_VOS2_LSECLK_BYP_MIN
#define STM32_PLLIN_MAX             STM32_VOS2_PLLIN_MAX
#define STM32_PLLIN_MIN             STM32_VOS2_PLLIN_MIN
#define STM32_PLLVCO_MAX            STM32_VOS2_PLLVCO_MAX
#define STM32_PLLVCO_MIN            STM32_VOS2_PLLVCO_MIN
#define STM32_PLLP_MAX              STM32_VOS2_PLLP_MAX
#define STM32_PLLP_MIN              STM32_VOS2_PLLP_MIN
#define STM32_PLLQ_MAX              STM32_VOS2_PLLQ_MAX
#define STM32_PLLQ_MIN              STM32_VOS2_PLLQ_MIN
#define STM32_PLLR_MAX              STM32_VOS2_PLLR_MAX
#define STM32_PLLR_MIN              STM32_VOS2_PLLR_MIN
#define STM32_PCLK1_MAX             STM32_VOS2_PCLK1_MAX
#define STM32_PCLK2_MAX             STM32_VOS2_PCLK2_MAX
#define STM32_ADCCLK_MAX            STM32_VOS2_ADCCLK_MAX

#define STM32_0WS_THRESHOLD         STM32_VOS2_0WS_THRESHOLD
#define STM32_1WS_THRESHOLD         STM32_VOS2_1WS_THRESHOLD
#define STM32_2WS_THRESHOLD         STM32_VOS2_2WS_THRESHOLD

#else
#error "invalid STM32_VOS value specified"
#endif

/* Clock handlers.*/
#include "stm32_bd.inc"
#include "stm32_lse.inc"
#include "stm32_lsi.inc"
#include "stm32_msi.inc"
#include "stm32_hsi16.inc"
#include "stm32_hse32.inc"

/*
 * HSI16 related checks.
 */
#if STM32_HSI16_ENABLED
#else /* !STM32_HSI16_ENABLED */

#if STM32_SW == STM32_SW_HSI16
#error "HSI16 not enabled, required by STM32_SW"
#endif

#if (STM32_SW == STM32_SW_PLL) && (STM32_PLLSRC == STM32_PLLSRC_HSI16)
#error "HSI16 not enabled, required by STM32_SW and STM32_PLLSRC"
#endif

#if (STM32_MCOSEL == STM32_MCOSEL_HSI16) ||                                 \
    ((STM32_MCOSEL == STM32_MCOSEL_PLL) &&                                  \
     (STM32_PLLSRC == STM32_PLLSRC_HSI16))
#error "HSI16 not enabled, required by STM32_MCOSEL"
#endif

#if (STM32_USART1SEL == STM32_USART1SEL_HSI16)
#error "HSI16 not enabled, required by STM32_USART1SEL"
#endif
#if (STM32_USART2SEL == STM32_USART2SEL_HSI16)
#error "HSI16 not enabled, required by STM32_USART2SEL"
#endif
#if (STM32_LPUART1SEL == STM32_LPUART1SEL_HSI16)
#error "HSI16 not enabled, required by STM32_LPUART1SEL"
#endif

#if (STM32_I2C1SEL == STM32_I2C1SEL_HSI16)
#error "HSI16 not enabled, required by I2C1SEL"
#endif
#if (STM32_I2C2SEL == STM32_I2C2SEL_HSI16)
#error "HSI16 not enabled, required by I2C2SEL"
#endif
#if (STM32_I2C3SEL == STM32_I2C3SEL_HSI16)
#error "HSI16 not enabled, required by I2C3SEL"
#endif

#if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_HSI16)
#error "HSI16 not enabled, required by LPTIM1SEL"
#endif
#if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_HSI16)
#error "HSI16 not enabled, required by LPTIM2SEL"
#endif
#if (STM32_LPTIM3SEL == STM32_LPTIM3SEL_HSI16)
#error "HSI16 not enabled, required by LPTIM3SEL"
#endif

#if (STM32_SPI2SEL == STM32_SPI2SEL_HSI16)
#error "HSI16 not enabled, required by SPI2S2SEL"
#endif

#if (STM32_STOPWUCK == STM32_STOPWUCK_HSI16)
#error "HSI16 not enabled, required by STM32_STOPWUCK"
#endif

#endif /* !STM32_HSI16_ENABLED */

/*
 * HSE32 related checks.
 */
#if STM32_HSE32_ENABLED

#else /* !STM32_HSE32_ENABLED */

  #if STM32_SW == STM32_SW_HSE
    #error "HSE32 not enabled, required by STM32_SW"
  #endif

  #if (STM32_SW == STM32_SW_PLL) && (STM32_PLLSRC == STM32_PLLSRC_HSE)
    #error "HSE32 not enabled, required by STM32_SW and STM32_PLLSRC"
  #endif

  #if (STM32_MCOSEL == STM32_MCOSEL_HSE32) ||                               \
      ((STM32_MCOSEL == STM32_MCOSEL_PLL) &&                              \
       (STM32_PLLSRC == STM32_PLLSRC_HSE))
    #error "HSE32 not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_RTCSEL == STM32_RTCSEL_HSE32DIV
    #error "HSE32 not enabled, required by STM32_RTCSEL"
  #endif

#endif /* !STM32_HSE32_ENABLED */

/*
 * LSI related checks.
 */
#if STM32_LSI_ENABLED
#else /* !STM32_LSI_ENABLED */

  #if STM32_RTCSEL == STM32_RTCSEL_LSI
    #error "LSI not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_MCOSEL == STM32_MCOSEL_LSI
    #error "LSI not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_LSCOSEL == STM32_LSCOSEL_LSI
    #error "LSI not enabled, required by STM32_LSCOSEL"
  #endif

  #if STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSI
    #error "LSI not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSI
    #error "LSI not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if STM32_LPTIM3SEL == STM32_LPTIM3SEL_LSI
    #error "LSI not enabled, required by STM32_LPTIM1SEL"
  #endif

  #if STM32_RNGSEL == STM32_RNGSEL_LSI
    #error "LSI not enabled, required by STM32_RNGSEL"
  #endif

#endif /* !STM32_LSI_ENABLED */

/*
 * LSE related checks.
 */
#if STM32_LSE_ENABLED

  #if (STM32_LSECLK == 0)
    #error "LSE frequency not defined"
  #endif

  #if !defined(STM32_LSE_BYPASS) && ((STM32_LSECLK < STM32_LSECLK_MIN) || (STM32_LSECLK > STM32_LSECLK_MAX))
    #error "STM32_LSECLK outside acceptable range (STM32_LSECLK_MIN...STM32_LSECLK_MAX)"
  #endif

  #if defined(STM32_LSE_BYPASS) && ((STM32_LSECLK < STM32_LSECLK_BYP_MIN) || (STM32_LSECLK > STM32_LSECLK_BYP_MAX))
    #error "STM32_LSECLK outside acceptable range (STM32_LSECLK_BYP_MIN...STM32_LSECLK_BYP_MAX)"
  #endif

#else /* !STM32_LSE_ENABLED */

  #if STM32_RTCSEL == STM32_RTCSEL_LSE
    #error "LSE not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_MCOSEL == STM32_MCOSEL_LSE
    #error "LSE not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_LSCOSEL == STM32_LSCOSEL_LSE
    #error "LSE not enabled, required by STM32_LSCOSEL"
  #endif

  #if STM32_MSIPLL_ENABLED
    #error "LSE not enabled, required by STM32_MSIPLL_ENABLED"
  #endif

  #if (STM32_USART1SEL == STM32_USART1SEL_LSE)
    #error "LSE not enabled, required by STM32_USART1SEL"
  #endif
  #if (STM32_USART2SEL == STM32_USART2SEL_LSE)
    #error "LSE not enabled, required by STM32_USART2SEL"
  #endif
  #if (STM32_LPUART1SEL == STM32_LPUART1SEL_LSE)
    #error "LSE not enabled, required by STM32_LPUART1SEL"
  #endif

  #if STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSE
    #error "LSE not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSE
    #error "LSE not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if STM32_LPTIM3SEL == STM32_LPTIM3SEL_LSE
    #error "LSE not enabled, required by STM32_LPTIM1SEL"
  #endif

